⊢ x():
    »(2¿𝕋)≡2
    »(0¿𝔽)≡□
    »[((L≔[0])₀≔'3'), L]≡3❟⋄[3❟]
    »L₀≡'3'
    »25≡((λx: x**2)(5))
    »25≡((x↦x**2)(5))
    »25≡((h≔⥌x↦x**2)(5))
x()

»[j∀_∈(j≔"hi")]≡"hi"⋄"hi"
»((lambda x,i=-1: [(i := i+1) for x in range(5)])(1))≡⚇⨯0…5

j=(x=2↦x**2)
»j()≡4
»j(3)≡9

k=⥌f=(x↦x**2),y=5↦(f(y*2), 𝔸, 𝕂)₀
»(k(y=8))≡256
»((x↦[x+5,𝔸₀ ₁,𝕂])(1, "hello", 3, yay="yay"))≡6⋄e❟⋄{'yay':'yay'}

֎
asduha8sy0ouduiahsd
adwkai
22=@+=q]apdd
֎֎dadasdasdadw23da2dwada֎

🟑 odjaao2hda=8092hdijonkl 🟑

y = 5
»((⥌y=y↦↦↦y)(6)()())≡6
»τ⌃2≡τ**2 ֎inline comment epic֎
»(1,a❟)₀≡1
»(2 y)≡7
»(1⋄2⋄3)₁≡2
»(a❟⋄(1¿𝔽¡2)⋄b❟)≡[a❟,2,b❟]
»((⑴x)ᴍa❟⋄ᐦ)≡['a','']
»(1⋄2|ᴍ(⑵x+y)²|3⋄4)≡[4,6]
»(ᴍ(⑵x+y,1⋄2,3⋄4))≡[4,6]
»(1⋄2|(ᴍ((⑵x+y)²→⑴x⌃2)²)|3⋄4)≡10⋄18
»(1⋄𝚲𝕋, 0⋄1¿1¡2⋄3)₀ ₁()≡𝕋
»((1⋄𝚲2⋄3)₁())≡[2,3]
»(⑴x+2)|ᴍ|↕(3)≡2⋄3⋄4
»'ab'⩫a❟≡b❟
»5≾int
»1…4≡range(1,4)

ₛ R ␉ 𝐢 ␉ swag
ₑ R ␉ ₀ ␉ cool
» "𝐢" ≡ "swag"
» "x₀" ≡ "x[0]"

☾⨯"Passed!"